---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AirSystemData Properties
AirSystemData Class See Also Send Feedback
---

The AirSystemData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AirFanType | The fan type. |
|  | ChilledWaterLoopId | The chilled water loop used for the chilled water option of cooling coil. |
|  | CoolingCoilType | The cooling coil type. Note this property change would reset the chilled water loop. |
|  | HeatExchangerType | The type of heat exchanger. |
|  | HeatingCoilType | The heating coil type. Note this property change would reset the heating water loop. |
|  | HeatingHotWaterLoopId | The water loop element id for the hot-water heating coil. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreheatCoilType | The preheat coil type. Note this property change would reset the preheat water loop. |
|  | PreheatHotWaterLoopId | The water loop element id for the hot-water preheat coil. |

# See Also

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace